tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "stripe/stripe-mock"

# ============================================
#  Language & Language/SDK/Lib Tools
# ============================================

# ~~ golang ~~
brew "go"
brew "dep"

# ~~ python ~~
brew "pyenv"

# ~~ java ~~
cask "java"

# ~~ node ~~
brew "nvm"
brew "yarn"

# ~~ android ~~
brew "kotlin"
cask "android-sdk"
cask "android-platform-tools"

# ~~ ios ~~
brew "cocoapods"

# ~~ flutter ~~
brew "usbmuxd", args: ["HEAD"]
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "ios-deploy"

# ============================================
#  Git
# ============================================

brew "git"
brew "gibo"
brew "tig"
cask "sourcetree" 

# ============================================
#  Mast CLI
# ============================================

brew "awscli"
brew "aws-shell"
brew "mas"
cask "fastlane"

# ============================================
#  Media Tools
# ============================================

brew "imagemagick"
brew "ghostscript"
brew "ffmpeg"

# ============================================
#  VM & Container & provisioning
# ============================================

brew "ansible"
cask "docker"
cask "minikube"
cask "virtualbox"
cask "vagrant"

# ============================================
#  IDE & Editor
# ============================================

mas "Xcode", id: 497799835
cask "jetbrains-toolbox"
cask "android-studio"
cask "visual-studio-code"
cask "sublime-text"

# ===========================================
#  Linter
# ===========================================

brew "swiftlint"

# ============================================
#  Mock & Code Gen
# ============================================

brew "hugo"
brew "openapi-generator"
brew "stripe/stripe-mock/stripe-mock"

# ============================================
#  VPN
# ============================================

cask "forticlient"
cask "tunnelblick"

# ============================================
#  Browser & Driver
# ============================================

cask "google-chrome"
cask "google-chrome-canary"
cask "firefox"
cask "firefox-nightly"
cask "chromedriver"

# ============================================
#  Chat & Message
# ============================================

cask "rocket-chat"
cask "slack"
mas "LINE", id: 539883307

# ============================================
#  Document
# ============================================

brew "pandoc"
cask "microsoft-office"

# ============================================
#  Utils
# ============================================

brew "peco"
brew "jq"
brew "nkf"
brew "tree"
brew "pwgen"
cask "google-japanese-ime"
cask "cyberduck"
cask "clipy"
cask "the-unarchiver"
mas "Parallels Client", id: 600925318

